Repository: MetaModels/contao-frontend-editing
Catalog: src/Resources/translations/*_metamodel_dca.*.xlf
Languages: de

# fe_editButtons_legend
source: Frontend edit buttons
de: Buttons im Frontend-Edit

# fe_notification_legend
source: Frontend notification
de: Notification beim Frontend-Edit

# fe_memberAttribut_legend
source: Frontend member permission
de: Berechtigung für Frontend-Mitglieder

# fe_overrideEditButtons.label
source: Override frontend edit buttons
de: Buttons für Frontend-Editing anpassen

# fe_overrideEditButtons.description
source: If is checked, so you can define the edit buttons.
de: Ist die Option gewählt, können die Buttons für das Frontend-Editing angepasst werden.

# fe_editButtons.label
source: Frontend edit buttons
de: Buttons im Frontend-Edit

# fe_editButtons.description
source: Here can you define the edit buttons.
de: Hier können Sie die Buttons im Frontend-Edit anpassen.

# fe_editButtons_name.description
source: Here can you define the edit button name - e.g. 'saveNCreate' for save and create or 'button.canel' for own keys.
de: Hier können Sie den Namen des Buttons festlegen - z. B. 'saveNCreate' für Speichern und Erstellen oder 'button.canel' für eigene Übersetzungsschlüssel.

# fe_editButtons_label.description
source: Here can you define the label of the edit button. If is not defined, so will look automatically for a translation BUTTON_NAME in model domain; is defined, we try to translate with default contao domain and fallback is raw text input.
de: Hier können Sie optional die Beschriftung des Buttons festlegen. Wenn nichts definiert ist, so wird automatisch eine Übersetzung für BUTTON_NAME in der Modell-Domäne gesucht; wenn es definiert ist, wird versucht, in der Standard-Contao-Domäne zu übersetzen und Fallback ist Rohtext-Eingabe.

# fe_editButtons_attributes.label
source: Attributes
de: Attribute

# fe_editButtons_attributes.description
source: Here can you define additional attributes for edit button html tag (e.g. accesskey='s').
de: Hier können Sie zusätzliche Attribute für den HTML-Tag des Buttons definieren (z. B. accesskey='s').

# fe_editButtons_jumpTo.label
source: Forwarding
de: Weiterleitung

# fe_editButtons_jumpTo.description
source: Here can you define the forward page.
de: Hier können Sie die Weiterleitungsseite festlegen.

# fe_editButtons_jumpToParameter.description
source: Here can you define additional url parameter for the forward page. You can use simple tokens e.g. ##model_alias## and Contao insert tags.
de: Hier können Sie zusätzliche URL-Parameter für die Weiterleitungsseite definieren. Sie können 'Simple-Token' verwenden, z. B. ##model_alias##.

# fe_editButtons_notSave.label
source: Not save
de: Nicht speichern

# fe_editButtons_notSave.description
source: Here can you define the model not saved. If the button clicked.
de: Hier können Sie festlegen, dass das Modell nicht gespeichert wird, wenn der Button geklickt wird.

# fe_create_notification.label
source: 'Create model
de: Datensatz erstellt

# fe_create_notification.description
source: This notification type sent when a new model is created.
de: Dieser Benachrichtigungstyp wird gesendet, wenn ein neuer Datensatz erstellt wurde.

# fe_edit_notification.label
source: Edit model
de: Datensatz bearbeitet

# fe_edit_notification.description
source: This notification type sent when a model is edited.
de: Dieser Benachrichtigungstyp wird gesendet, wenn ein Datensatz bearbeitet wurde.

# fe_copy_notification.label
source: Copy model
de: Datensatz kopiert

# fe_copy_notification.description
source: This notification type sent when a model is copied.
de: Dieser Benachrichtigungstyp wird gesendet, wenn ein Datensatz kopiert wurde.

# fe_delete_notification.label
source: Delete model
de: Datensatz löschen

# fe_delete_notification.description
source: This notification type sent when a model is deleted.
de: Dieser Benachrichtigungstyp wird gesendet, wenn ein Datensatz gelöscht wurde.

# fe_useMemberPermissions.label
source: Activate member permissions
de: Zugriffsberechtigung für Frontend-Mitglieder aktivieren

# fe_useMemberPermissions.description
source: With this option, a logged-in member is saved in the record and only the member can edit the record again. You can create your own event listener for more complex assignment of rights.
de: Mit dieser Option wird ein eingeloggtes Mitglied im Datensatz gespeichert und nur dieses Mitglied kann den Datensatz wieder bearbeiten. Für eine komplexere Rechtevergabe können Sie einen eigenen Event-Listener erstellen.

# fe_memberAttribut.label
source: Attribut for member
de: Mitglieder-Attribut

# fe_memberAttribut.description
source: Select the attribute with which you have created the connection to the members table "tl_member" and alias to "username".
de: Wählen Sie das Attribut aus, mit dem Sie die Verbindung zur Mitgliedertabelle "tl_member" erstellt haben und den Alias "username" hat.
